In [1]:
import pandas as pd
df = pd.read_excel("../武汉打车.xlsx", engine = "openpyxl")
df.head()

,mapbegin,mapbeginlon,mapbeginlat,mapbeginlon.1,mapbeginlat.1,mapend,mapendlon,mapendlat,mapendlon.1,mapendlat.1,打车次数
0,民族大道光谷广场-公交站路东,114.386925,30.500459,114.398925,30.504459,光谷|曙光星城B区,114.391000,30.482508,114.403000,30.486508,174
1,民族大道光谷广场-公交站路东,114.386925,30.500459,114.398925,30.504459,光谷天地,114.397825,30.473273,114.409825,30.477273,158
2,民族大道光谷广场-公交站路东,114.386925,30.500459,114.398925,30.504459,光谷|丽顿酒店,114.410591,30.497201,114.422591,30.501201,145
3,纸坊|金逸影城(九全嘉国际广场店),114.317790,30.354540,114.329790,30.358540,纸坊|江夏体育馆,114.303393,30.349184,114.315393,30.353184,142
4,纸坊|美味传奇农家菜馆,114.306421,30.348027,114.318421,30.352027,江夏区第一人民医院,114.308387,30.367964,114.320387,30.371964,140

In [2]:
df.mapbegin.dtype

dtype('O')

* 'b'       boolean
* 'i'       (signed) integer
* 'u'       unsigned integer
* 'f'       floating-point
* 'c'       complex-floating point
* 'O'       (Python) objects
* 'S', 'a'  (byte-)string
* 'U'       Unicode
* 'V'       raw data (void)

In [3]:
df.dtypes

mapbegin          object
mapbeginlon      float64
mapbeginlat      float64
mapbeginlon.1    float64
mapbeginlat.1    float64
mapend            object
mapendlon        float64
mapendlat        float64
mapendlon.1      float64
mapendlat.1      float64
打车次数               int64
dtype: object

In [4]:
df.打车次数.astype("float64")

0       174.0
1       158.0
2       145.0
3       142.0
4       140.0
        ...
8351      5.0
8352      5.0
8353      5.0
8354      5.0
8355      5.0
Name: 打车次数, Length: 8356, dtype: float64

In [5]:
df.index.dtype

dtype('int64')

In [22]:
reviews = pd.DataFrame({"Name": ["Alice", "Bob", None], "Age":[12, 13, None]})
reviews

    Name   Age
0  Alice  12.0
1    Bob  13.0
2   None   NaN

In [10]:
pd.isnull(reviews.Name)

0    False
1    False
2     True
Name: Name, dtype: bool

In [12]:
reviews[pd.isnull(reviews.Name)]

   Name  Age
2  None  NaN

In [24]:
reviews.Name = reviews.Name.fillna("Unknown")
reviews

      Name   Age
0    Alice  12.0
1      Bob  13.0
2  Unknown   NaN

In [26]:
reviews.Name.replace("Unknown", "Kevin")

0    Alice
1      Bob
2    Kevin
Name: Name, dtype: object